# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceSet..::..Insert Method
SpaceSet Class See Also
---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	Space item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As Space _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	Space^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Mechanical..::..Space
# See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace